In [10]:
import pandas as pd

In [12]:
df=pd.Series(['banana',42])
print(df)

0    banana
1        42
dtype: object

In [14]:
df=pd.Series(data=['wes Mckinney', 'creator of pandas'],index=['person','who'])
print(df)

person         wes Mckinney
who       creator of pandas
dtype: object

In [18]:
scientists=pd.DataFrame({
    "Name":["Rosaline Franklin", "william Gosset"],
    "occupation":["chemist", "statistician"],
    "Born":["1920-0725", "1876-0613"],
    "Died":["1958-04-16", "1937-10-16"],
    "Age":[37,61],
})
print(scientists)

                Name    occupation       Born        Died  Age
0  Rosaline Franklin       chemist  1920-0725  1958-04-16   37
1     william Gosset  statistician  1876-0613  1937-10-16   61

In [46]:
scientists=pd.DataFrame(
    data={
    "occupation":["chemist", "statistician"],
    "born":["1920-07-25", "1876-06-13"],
    "Died":["1958-04-16", "1937-10-16"],
    "Age":[37,61],
},
index=["Rosaline Franklin", "William Gosset"],
columns=["occupation", "born","Died","Age"],
)
print(scientists)

                     occupation        born        Died  Age
Rosaline Franklin       chemist  1920-07-25  1958-04-16   37
William Gosset     statistician  1876-06-13  1937-10-16   61

In [48]:
first_row=scientists.loc['William Gosset']
print(type(first_row))

<class 'pandas.core.series.Series'>

In [50]:
print(first_row.index)

Index(['occupation', 'born', 'Died', 'Age'], dtype='object')

In [52]:
print(first_row.values)

['statistician' '1876-06-13' '1937-10-16' 61]

In [43]:
# loc 열이름으로 데이터추출 
# iloc 열위치로 데이터추출
# dtype dtypes 시리즈에 저장된값의 자료형
# T 시리즈의 전치
# shape 데이터의차원
# size 시리즈의 요소의 개수
# values 시리즈의 ndarray 또는 ndarray 와 같은형태

array([ 8.18264433e-02, -2.69523979e+01,  2.27665029e+03])

In [54]:
print(first_row.keys())

Index(['occupation', 'born', 'Died', 'Age'], dtype='object')

In [56]:
print(first_row.index[0])

occupation

In [58]:
ages=scientists['Age']
print(ages)

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [62]:
print (ages.mean()) # 평균

49.0

In [64]:
print (ages.min()) # 최솟값

37

In [66]:
print (ages.max()) # 최댓값

61

In [68]:
print (ages.std()) # 표준편차

16.97056274847714

In [ ]:
'''
append() 2개이상의 시리즈연결
corr() 다른시리즈와의 상관관계 계산 (결측값은 자동으로 제외)
cov() 다른시리즈와의 공분산 계산
describe() 요약통계량 계산 (결측값은 자동으로 제외)
drop_duplicates() 중복값이 없는 시리즈 반환
equls() 시리즈에 주어진값을 가진요소가 있는지 확인
get_values() 시리즈 값구하기(values 속성과 동일)
hist() 히스토그램구하기
isin() 주어진값이 시리즈에포함되어있는지 확인
min() 최솟값확인 
max() 최댓값확인
mean() 산술평균확인
median() 중앙값확인
mode() 최빈값
quantile() 사분위수로 반환
replace() 시리즈의 특정값반환
sample() 시리즈의 임의의값
sort_values() 값정렬
to_frame() 시리즈를 데이터 프레임으로 변환
transpose() 시리즈의 전치반환
unique() 고윳값으로 이루어진 numpy.ndarray를 반환
'''

In [72]:
scientists=pd.read_csv("scientists.csv")
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [74]:
ages=scientists['Age']
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [76]:
print(ages.describe())

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [78]:
print(ages.mean())

59.125

In [82]:
print(ages[ages>ages.mean()])

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [84]:
print(ages>ages.mean())

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [86]:
print(type(ages>ages.mean()))

<class 'pandas.core.series.Series'>

In [90]:
manual_bool_values=[
    True,
    True,
    False,
    False,
    True,
    True,
    False,
    True,
]
print(ages[manual_bool_values])

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

In [92]:
print(ages+ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [94]:
print(ages*ages)

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [96]:
print(ages+100)

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [98]:
print(ages*2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [102]:
print(ages+pd.Series([1,100]))

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [104]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [106]:
rev_ages=ages.sort_index(ascending=False)
print(rev_ages)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [109]:
print(ages*2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [111]:
print(ages+rev_ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [113]:
scientists.index

RangeIndex(start=0, stop=8, step=1)

In [115]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [117]:
scientists.values

array([['Rosaline Franklin', '1920-07-25', '1958-04-16', 37, 'Chemist'],
       ['William Gosset', '1876-06-13', '1937-10-16', 61, 'Statistician'],
       ['Florence Nightingale', '1820-05-12', '1910-08-13', 90, 'Nurse'],
       ['Marie Curie', '1867-11-07', '1934-07-04', 66, 'Chemist'],
       ['Rachel Carson', '1907-05-27', '1964-04-14', 56, 'Biologist'],
       ['John Snow', '1813-03-15', '1858-06-16', 45, 'Physician'],
       ['Alan Turing', '1912-06-23', '1954-06-07', 41,
        'Computer Scientist'],
       ['Johann Gauss', '1777-04-30', '1855-02-23', 77, 'Mathematician']],
      dtype=object)

In [119]:
print(scientists.loc[scientists['Age']>scientists['Age'].mean()])

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [ ]:
'''
df[column_name] 시리즈
df[[column1,column2,...]] 데이터프레임
df.loc[row_label] 행이름으로 추출한 행데이터
df.loc[[label1,label2,....]] 행이름으로 추출한 여러행 데이터
df.iloc[row_number] 행번호로 추출한 여러행 데이터
df[bool] 불리언으로 추출한 행데이터
df[[bool1,bool2,...]] 불리언으로 추출한 여러행 데이터
df[start:stop:step] 슬라이ㅣㅇ 구분으로 추출한 여러행 데이터 
'''

In [121]:
first_half=scientists[:4]
second_half=scientists[4:]
print(first_half)

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [123]:
print(second_half)

            Name        Born        Died  Age          Occupation
4  Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5      John Snow  1813-03-15  1858-06-16   45           Physician
6    Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7   Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [125]:
print(scientists*2)

                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

In [127]:
df1=df2=pd.DataFrame(data=[[1,2,3],[4,5,6],[7,8,9]])
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [129]:
df2

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [131]:
df_added=df1.add(df2)

In [133]:
print(df_added)

    0   1   2
0   2   4   6
1   8  10  12
2  14  16  18

In [135]:
print(scientists.dtypes)

Name          object
Born          object
Died          object
Age            int64
Occupation    object
dtype: object

In [137]:
born_datetime=pd.to_datetime(scientists['Born'],format='%Y-%M-%d')
print(born_datetime)

0   1920-01-25 00:07:00
1   1876-01-13 00:06:00
2   1820-01-12 00:05:00
3   1867-01-07 00:11:00
4   1907-01-27 00:05:00
5   1813-01-15 00:03:00
6   1912-01-23 00:06:00
7   1777-01-30 00:04:00
Name: Born, dtype: datetime64[ns]

In [139]:
died_datatime=pd.to_datetime(scientists['Died'],format='%Y-%M-%d')

In [143]:
print(scientists.head())

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [145]:
print(scientists.shape)

(8, 5)

In [147]:
print(scientists['Age'])

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [149]:
print(scientists['Age'].sample(frac=1,random_state=42))

1    61
5    45
0    37
7    77
2    90
4    56
3    66
6    41
Name: Age, dtype: int64

In [151]:
print(scientists['Age'].sample(frac=1,random_state=42))

1    61
5    45
0    37
7    77
2    90
4    56
3    66
6    41
Name: Age, dtype: int64

In [153]:
scientists['Age']=scientists['Age'].sample(frac=1,random_state=42).values
print(scientists['Age'])

0    61
1    45
2    37
3    77
4    90
5    56
6    66
7    41
Name: Age, dtype: int64

In [155]:
print(scientists.columns)

Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [163]:
scientists_dropped=scientists.drop(['Age'],axis="columns")

In [165]:
scientists_dropped

                   Name        Born        Died          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16             Chemist
1        William Gosset  1876-06-13  1937-10-16        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13               Nurse
3           Marie Curie  1867-11-07  1934-07-04             Chemist
4         Rachel Carson  1907-05-27  1964-04-14           Biologist
5             John Snow  1813-03-15  1858-06-16           Physician
6           Alan Turing  1912-06-23  1954-06-07  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23       Mathematician

In [167]:
names=scientists['Name']
print(names)

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [173]:
names.to_pickle('scientists_names_series.pickle')

In [177]:
scientists.to_pickle('scientists_df.pickle')

In [181]:
series_pickle=pd.read_pickle('scientists_names_series.pickle')
series_pickle

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [183]:
data_frame_pickle=pd.read_pickle('scientists_df.pickle')

In [185]:
data_frame_pickle

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   61             Chemist
1        William Gosset  1876-06-13  1937-10-16   45        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   37               Nurse
3           Marie Curie  1867-11-07  1934-07-04   77             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   90           Biologist
5             John Snow  1813-03-15  1858-06-16   56           Physician
6           Alan Turing  1912-06-23  1954-06-07   66  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   41       Mathematician

In [191]:
scientists.to_csv('scientists_df_no_index.csv',index=False)

In [193]:
df=pd.read_csv('scientists_df_no_index.csv')
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   61             Chemist
1        William Gosset  1876-06-13  1937-10-16   45        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   37               Nurse
3           Marie Curie  1867-11-07  1934-07-04   77             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   90           Biologist
5             John Snow  1813-03-15  1858-06-16   56           Physician
6           Alan Turing  1912-06-23  1954-06-07   66  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   41       Mathematician

In [197]:
pip install openpxl

Note: you may need to restart the kernel to use updated packages.

ERROR: Could not find a version that satisfies the requirement openpxl (from versions: none)
ERROR: No matching distribution found for openpxl

In [199]:
names=scientists['Name']
print(names)

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [201]:
names_df=names.to_frame()

In [205]:
names_df.to_excel('scientists_names_series_df.xls',engine='openpyxl')

In [209]:
scientists.to_excel("scientists_df.xlsx",sheet_name="scientists",index=False)